Revit 2027 API
PipeFittingAndAccessoryPressureDropData.GetPresureDropItems Method
 Returns the pressure drop items
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<PipeFittingAndAccessoryPressureDropItem> GetPresureDropItems()
Public Function GetPresureDropItems As IList(Of PipeFittingAndAccessoryPressureDropItem)
public:
IList<PipeFittingAndAccessoryPressureDropItem^>^ GetPresureDropItems()
member GetPresureDropItems : unit -> IList<PipeFittingAndAccessoryPressureDropItem>
Return Value
IList<PipeFittingAndAccessoryPressureDropItem>
See Also
Reference
PipeFittingAndAccessoryPressureDropData Class
Autodesk.Revit.DB.Plumbing Namespace